<template>
  <div>
    <h1> Moving Average</h1>

    <p>
      移動平均線(MA)是將一段時間內的股價相加平均後得到的平均值連接之後所得到的一條線。有了MA的幫助，投資者就能夠輕易地了解目前股價的趨勢。<br>
      一般來說，MA通常分為短、中、長期移動平均線三種。
    </p>

    <b-table striped hover :items="items"></b-table>

    <p>
      短線中的5MA、10MA分別對應到一周與雙週的開盤日數，又稱作週線及雙週線。而中線的20MA、60MA分別對應到一個月和三個月的開盤日數，又稱作月線以及季線。<br>
      在長線部分，120MA、240MA分別對應到半年和一年的開盤日數，又稱半年線和年線。
    </p>

    <p>
      而在實際運用上，我們通常會利用短線與中線或者是中線與長線的搭配來觀察股價的走勢。如下圖的例子，10MA由下往上穿越20MA。
      因為近10日股價上揚，讓10MA的斜率逐漸變大，能夠由下而上的穿越20MA，我們將此現象認為是起漲的開始，因此將兩條線的交叉視為是買入訊號，而這樣的訊號又被稱為黃金交叉。
    </p>
    <img src="../assets/MA/golden_cross.png" class="card-img-top" alt="MA 黃金交叉">
    <p>
      而當10MA由上往下穿越20MA時，因為近10日的股價下跌，讓10MA的斜率越來越小，最後由上而下的穿越20MA，
      我們將此現象認為是下跌的開始，因此將這兩條線的交叉點視為是賣出訊號，而這樣的訊號被稱為死亡交叉。
    </p>
    <img src="../assets/MA/death_cross.png" class="card-img-top" alt="MA 死亡交叉">
    <p>
      而除了移動平均線之外，也有因為使用目的上的不同，在計算移動平均時對於時序的遠近而改變權重所演變出其他類型的移動平均線，
      例如：指數移動平均(EMA)、加權移動平均(WMA)等。投資人可以因應自身的習慣或者是觀察的重點來搭配自己所需要的移動平均線。
    </p>
    <hr>
    <h1>RSI</h1>
    <p>Description</p>
  </div>
</template>

<script>
export default {
  name: "Intro",
  data() {
    return {
      items: [
        {
          '參數': '短線：5、10' + '中線：20、60' + '長線：120、240',
          '交易訊號': '短線搭配中線' + '中線搭配長線',
          '買賣參數': '使用同一組參數',
          '交易': '（5,20）,(5,60)' + '(10,20) ,(10,60)' + '(20,120),(20,240)' + '(60,120),(60,240)'
        }
      ]
    }
  },
}
</script>

<style scoped>

</style>